Autodesk.Revit.DB.BuiltInFailures.ColumnInsideWallFailures.StopCutShadowJoin
Two joined walls are no longer in a position to allow automatic insert copying. They are either non-parallel or non-overlapping.

Autodesk.Revit.DB.BuiltInFailures.ColumnInsideWallFailures.StartCutShadowJoin
Two joined walls are in a position to allow automatic insert copying.

Autodesk.Revit.DB.BuiltInFailures.ColumnInsideWallFailures.CopingWarningOffset
Coping applied, but no cut was made. Adjust Coping Distance or Offset parameters.

Autodesk.Revit.DB.BuiltInFailures.ColumnInsideWallFailures.CopingWarningMedium
Coping applied, but only in Medium Detail Level.

Autodesk.Revit.DB.BuiltInFailures.ColumnInsideWallFailures.CopingWarningIgnored
Cuts on concrete members are ignored.

Autodesk.Revit.DB.BuiltInFailures.ColumnInsideWallFailures.CopingWarningExtension
Coping applied, but no cut was made. Adjust Coping Distance or Extension parameters.

Autodesk.Revit.DB.BuiltInFailures.ColumnInsideWallFailures.ColumnInsideWall
One element is completely inside another.

Autodesk.Revit.DB.BuiltInFailures.ColumnInsideWallFailures
Failures description ColumnInsideWall